---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.FabricSheet
source: html/1fa7c7f4-1ae7-7681-0c72-41db1b3b6750.htm
---
# FabricSheet Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.